{"/":{"title":"Welcome to the Fellenoord developer wiki","data":{"":"Hello, world!"}},"/setup/git":{"title":"Git","data":{"":"Git should already be installed on your Linux distribution or MacOS version. You can check by using git --version in the command line. However if it's not installed do so using:\n# Linux\nsudo apt-get install git\n\n# MacOS\nbrew install git"}},"/setup":{"title":"Index","data":{"":"This entire wiki assumes the use of an unix-based system. If you are using MacOS this requires no further setup, however, for Windows the Windows Subsystem for Linux (WSL) is encouraged.A guide to setup WSL can be found here. For MacOS look here."}},"/setup/macos":{"title":"macOS","data":{"":"","command-line-tools#Command Line tools":"As a MacOS developer you need have the Xcode Command Line Tools installed.\nxcode-select --install","homebrew#Homebrew":"When using MacOS it is recommended to use the Homebrew package manager. It installs stuff using the command line. To install homebrew simply run the following:\n/bin/bash -c \"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)\""}},"/setup/nodejs":{"title":"Nodejs","data":{"":"When using Node.js it recommended to use the Node Version Manager (NVM) to quickly install and use different versions of node via the command line. Run and download the script using cURL:\ncurl -o- https://raw.githubusercontent.com/nvm-sh/nvm/v0.39.3/install.sh | bash\nThen, after reopening the terminal, use nvm --version to check if it has installed properly. Finally, we can install the latest version of Node using nvm install --lts."}},"/setup/wsl":{"title":"Wsl","data":{"":"A guide to get Windows Subsystem for Linux (WSL) up and running for web development. It will cover setting up the WSL environment, and all the tools needed.","prerequisites#Prerequisites":"This guide assumes you are on a recent build of Windows (20262+, and preferably Windows 11). The guide has been tested for Microsoft Windows Version 22H2 (OS Build 22621.963). To check your version and build number, select WIN + R, type winver, and select OK. Furthermore, if you prefer a different Linux distribution other than Ubuntu, please refer to the sources below.With Windows 11, Windows Terminal is installed by default. If you do not have Windows Terminal, please follow this guide to do so.","get-started#Get started":"Open PowerShell, and enter:\nwsl --install\nThis enables the WSL and Virtual Machine Platform components, downloads and installs the latest Linux kernel, sets WSL 2 as the default, and downloads and installs the Ubuntu Linux distribution.You will need to restart your machine to complete the installation process.","set-up-linux#Set up Linux":"After the restart a terminal window will open to setup your Linux distribution. Now you will be asked to create username and password.\nThese credentials have no bearing on your Windows username and password.\nNote that whilst entering the password, nothing will appear on screen (blind typing).\nThis will be the default user, and considered the Linux administrator, with the ability to run sudo (Super User Do) commands.\n\nTo change or reset your password find more information here.It is recommended to keep your packages up-to-date. So after we reach the login screen we update and upgrade:\nsudo apt update && sudo apt upgrade"}}}